# -*- coding: utf-8 -*-

dict1={"a":"1","b":"2","c":"3","d":"4","e":"5","f":"6"}
# 遍历
print (dict1.__str__())
print("------------------------------------")


# 增加
dict1['g'] = "7"
dict1['h'] = "8"

print (dict1.__str__())
print("------------------------------------")

# 修改
dict1['a'] = "A"
dict1['b'] = "B"
print (dict1.__str__())
print("------------------------------------")

# 删除
del  dict1["a"]
del dict1["b"]
print (dict1.__str__())
print("------------------------------------")



















